# Задача №2

print("Расчет угла поворота стрелок часов.")
print("Ведите количество часов:")
h2 = int(input())
print("Ведите количество минут:")
m2 = int(input())
u1 = (h2 * 30)  # 30 градусов - угол поворота часовой стрелки
u2 = (m2 * 6)  # 6 градусов - угол поворота минутной стрелки

print("Это:\n", h2, end='')

if 5 <= h2 <= 20:
    print(' часов')
else:
    if h2 % 10 == 1:
        print(' час')
    else:
        if 2 <= h2 % 10 <= 4:
            print(' часа')
        else:
            print(' час')

print(m2, end='')

if 2 <= m2 <= 20:
    print(' минут')
else:
    if m2 % 10 == 1:
        print(' минута')
    else:
        if 2 <= m2 % 10 <= 4:
            print(' минуты')
        else:
            print(' минут')

print("\nУгол поворота часовой стрелки", u1, "° ." "\nугол поворота минутной стрелки", u2, "° .")
